{
  "pageTitle": "GAME MECHANICS",
  "chapterTitle": "RULEBOOK",
  "mechanics": [
    {
      "title": "GROWING DARKNESS",
      "bodyHTML": "<p>The Darkness is in a “growing” stage when it lacks the strength to hunt the Heroes. In practice, this mechanic acts as a countdown timer for the dungeon without adding strategic complications for the Heroes. Whenever the Initiative Marker reaches the Growing Darkness card on the Initiative Track, the Party must:</p><ul><li class=\"custom-bullet filled\">Draw the indicated number of Runes, one at a time—Side “A” draws 1 Rune, side “B” draws 2 Runes.</li><li class=\"custom-bullet filled\">Stack the drawn Runes onto the Initiative Track, in the appropriate space(s).</li><li class=\"custom-bullet filled\">Flip the Growing Darkness card.</li></ul><p>Growing Darkness is a Rune card and therefore must be placed at the very bottom end of the Initiative Track, in the Rune slot.</p>"
    },
    {
      "title": "DARKNESS HUNTING",
      "bodyHTML": "<p>When the Darkness has enough strength to pursue the Heroes, it enters the “hunting” stage. This mechanic drives the dungeon’s countdown while also causing Darkness tiles to spawn on the board. Effects that bring the Darkness Hunting Rune card into play define two aspects: Darkness Spawning Points and Darkness Behavior. The first indicates where the tiles spawn; the second determines the target they pursue. Unless otherwise stated, the Darkness Behavior is “Standard”, as described below.</p><p>Whenever the Initiative Marker reaches the Darkness Hunting card, the Party must:</p><ul><li class=\"custom-bullet filled\">Draw the indicated number of Runes, one at a time—Side “A” draws 1 Rune, side “B” draws 2 Runes.</li><li class=\"custom-bullet filled\">Spawn the corresponding Darkness tile(s) pursuing its target. Each tile can spawn from any Darkness Spawning Point or from another Darkness tile already on the board (either a Darkness piece or a Map), always whichever is closest to the target. The tile doesn’t need to hit the most Heroes it possibly can if the Party chooses otherwise. For details, see the “Spawning Darkness Tiles” section.</li><li class=\"custom-bullet filled\">Stack the drawn Rune(s) onto the Initiative Track.</li><li class=\"custom-bullet filled\">Flip the Darkness Hunting card.</li></ul><p>Darkness Hunting is a Rune card and therefore must be placed at the very bottom end of the Initiative Track, in the Rune slot.</p>"
    },
    {
      "title": "SPAWNING DARKNESS TILES",
      "bodyHTML": "<p>Whenever a Darkness tile is spawned, the Party must:</p><ul><li class=\"custom-bullet filled\">Using the Standard Behavior, target the Strongest Hero at Any Range who is not already on Darkness.</li><li class=\"custom-bullet filled\">Tiles may spawn from a Darkness Spawning Point or orthogonally adjacent to another Darkness tile, whichever is closest to the target.</li><li class=\"custom-bullet filled\">Tiles must be placed as efficiently as possible to reach the target.</li><li class=\"custom-bullet filled\">If the tile doesn’t reach the target, it must be placed as close as possible, but always orthogonally connected to the closest Spawning Point or existing Darkness tile.</li><li class=\"custom-bullet filled\">If multiple placements are valid, choose the one most beneficial to the Heroes.</li><li class=\"custom-bullet filled\">If the tile does not fit entirely on the Board Level it spawns on, or if it must overlap a Board Level to follow the rule above, it splits into 3 Small Darkness tiles instead. If the Small tiles reach the Strongest Hero with the first or second placement, the others pursue the next Strongest Hero.</li><li class=\"custom-bullet filled\">If all Heroes are already on Darkness when a full-size tile (not Small tiles) should be spawned, skip that spawning. Instead, all Heroes suffer CRUSH damage.</li></ul><p>CRUSH deals P non-preventable damage to each Hero at Any Range, where P is the number of Heroes in the Party. CRUSH is not the same as Darkness damage—even Heroes immune to Darkness are affected by CRUSH.</p>"
    },
    {
      "title": "MONSTER RAID",
      "bodyHTML": "<p>When an area is dominated by the Minions of Darkness, the nodes can teleport them through the dark plasma. This mechanic creates a continuous summoning of Monsters as long as there are Darkness Nodes on the board.</p><p>Monster Raids specify which Monster acts as the Minions. Monsters that use the same model as the Minions cannot be used as Random Monsters during the Monster Raid.</p><p>Whenever the Initiative Marker reaches the Monster Raid card, the Party must:</p><p>Check for any Rune Nodes on the board. If none are present, this card has no effect. Flip the Monster Raid card over and continue to the next turn.</p><p>If there are, check the card’s face-up side:</p><ul><li class=\"custom-bullet filled\">Side “A”—Only summons Minions if all Monsters have been defeated. If any Monsters are still on the board, just flip the Monster Raid card over and continue to the next turn.</li></ul><ul><li class=\"custom-bullet filled\"> Side “B”—Always summons Monsters. Continue with the following steps:</li></ul><ul><li class=\"custom-bullet filled\">Reveal 1 Rune from the bag to determine which color to MANIFEST. Return it to the bag afterward. If the bag is empty, the Party is already in Sudden Death, and nothing happens.</li><li class=\"custom-bullet filled\">Summon Minions adjacent to a Rune on the board that matches the manifested color. If no adjacent spaces are available, the Minion is not summoned.</li><li class=\"custom-bullet filled\">If no colored base is available for the new Minion, it also is not summoned. (Monster Status board limit = 12.)</li><li class=\"custom-bullet filled\">The number of Minions summoned and the penalty for summoning failures are campaign-specific. In Drunagor Nights, 1 Minion per Hero must be summoned in each wave. If any of these Minions cannot be summoned for any reason, deal 3 non-preventable damage to each Hero at Any Range for each Minion that could not be summoned.</li><li class=\"custom-bullet filled\">Flip the Monster Raid card over.</li></ul><p>Monster Raid is a Game Mechanic card and therefore must be placed at the top end of the Initiative Track, opposite the Rune slot.</p>"
    }
  ]
}