{
  "pageTitle": "TUTORIAL",
  "chapters": [
    {
      "chapterTitle": "Game Rules 1",
      "tutorials": [
        {
          "title": "TURNS AND ROUNDS",
          "bodyHTML": "<p>Chronicles of Drunagor is played over a series of turns and rounds. A turn is the moment when a Character takes Actions. The round is completed when the last Character on the board finishes their Actions. The Initiative Track organizes this process.</p><div style=\"text-align: center; margin: 20px 0;\"><img src=\"https://druna-assets.s3.us-east-2.amazonaws.com/book/images/001-min.png\" alt=\"Initiative Track and Marker example\" style=\"width: 100%; height: auto; margin-bottom: 5px;\"><p style=\"font-style: italic; color: #555;\">This is the Initiative Track and Marker.</p></div><ul><li class=\"custom-bullet filled\">When the Initiative Marker reaches a Character’s card, it is their turn. When they finish their turn, move the marker to the next card.</li><li class=\"custom-bullet filled\">After the last card on the track has been activated, the marker returns to the first card, starting the next round.</li><li class=\"custom-bullet filled\">The turn order runs from left to right and from the top to the bottom of the track, as if it were a long straight line.</li></ul><p>Place the End of the Round Game State Check-Up card at the bottom end of the Initiative Track. It serves as a reminder of some processes that take place at the end of each round.</p><div style=\"text-align: center; margin: 20px 0;\"><img src=\"https://druna-assets.s3.us-east-2.amazonaws.com/book/images/002-min.png\" alt=\"End of Round card placement\" style=\"width: 100%; height: auto; margin-bottom: 5px;\"><p style=\"font-style: italic; color: #555;\">This is where the End of the Round card goes on the Initiative Track.</p></div>"
        },
        {
          "title": "HERO TURN",
          "bodyHTML": "<p>Heroes can take the following Actions during their turn, alternating between them as they choose:</p><ul><li class=\"custom-bullet filled\">Take up to one Move Action</li><li class=\"custom-bullet filled\">Take up to two Cube Actions</li></ul><p>Heroes are not required to take all the Actions they are entitled to.</p><p>We will begin by learning just these two types of Actions. Whenever a new type of Action becomes available to the Heroes, it will come with a complementary set of instructions much like the following.</p>"
        },
        {
          "title": "MOVE ACTION",
          "bodyHTML": "<p>The Move Action is the basic way Heroes move in CoD. It grants 3 movement points that can be used to move around the board.</p><ul><li class=\"custom-bullet filled\">Each square moved into costs 1 movement point.</li><li class=\"custom-bullet filled\">Diagonal movement is allowed and does not cost additional points.</li><li class=\"custom-bullet filled\">Movement up or down board levels does not cost additional points, as long as the change is only one level for each square moved.</li><li class=\"custom-bullet filled\">Heroes can travel through (but not stop in) squares occupied by their allies. They cannot travel through those occupied by enemies, though.</li><li class=\"custom-bullet filled\">Heroes do not need to use all their movement points.</li><li class=\"custom-bullet filled\">If a Hero is moving and decides to take a Cube Action while they still have movement points to spend, those points are lost.</li></ul><p>If a Hero wants to take another Move Action in the same turn, they may use a Cube Action to do so: They discard 1 Action Cube from their Pool to take an additional Move Action with 3 movement points, placing the discarded Cube in their “Expended Cubes Box” on their Hero board.</p>"
        },
        {
          "title": "CUBE ACTION",
          "bodyHTML": "<p>“Cube Action” is the name given to any Action where a Hero uses an Action Cube during their turn. Usually, this is to perform one of their Skills. To take a Cube Action, the Hero must spend a Cube of the appropriate color, placing it in the slot corresponding to the Skill they are using. Here are some details about these actions:</p><ul><li class=\"custom-bullet filled\">A Hero can only take Cube Actions during their own turn.</li><li class=\"custom-bullet filled\">The type (color) of the Cube determines the Range for all effects of that Skill:<ul><li class=\"custom-bullet open\">Melee (yellow): Targets Characters adjacent to the Hero.</li><li class=\"custom-bullet open\">Ranged (red): Targets Characters within Range 1, that is, in any square in the same area (blue square) or in an area adjacent to the one the Hero is in.</li><li class=\"custom-bullet open\">Agility (green) or Wisdom (blue): Targets Characters anywhere on the board.</li><li class=\"custom-bullet open\">A Hero is always within Range of any effects they cast themselves.</li></ul></li><li class=\"custom-bullet filled\">Once an Action Cube is used, it remains slotted into the socket of the Skill it was used to trigger until it is Recalled through a process we’ll cover later, the Recall Action.</li><li class=\"custom-bullet filled\">A Skill is read from left to right, paying attention to the punctuation marks:<ul><li class=\"custom-bullet open\">The first term, followed by a colon (:), indicates the type of Targets that Skill can be used on. “SELF: SHIELD 2” – The allowed target for this effect is SELF, the Hero using this Skill.</li><li class=\"custom-bullet open\">Comma (,) and AND: These are used as in grammar, uniting the Keywords of a single effect. “SELF: MAKE A <img src=\"/icons/2-melee-dmg.svg\" class=\"inline-icon\" alt=\"Melee Damage\"> OF +3 TO HIT, KEEN, AND +2 DMG” – This Attack has 3 Keywords: +3 TO HIT, KEEN, and +2 DMG.</li><li class=\"custom-bullet open\">Semicolon (;): Separates two different effects of the same Skill. “SELF: SHIELD 2; ANY TARGET: 2 <img src=\"/icons/1-spell-dmg.svg\" class=\"inline-icon\" alt=\"Spell Damage\"> DMG” – This Skill has two effects. The first of these grants SHIELD 2 to the Hero using it. The second, in turn, deals 2 <img src=\"/icons/1-spell-dmg.svg\" class=\"inline-icon\" alt=\"Spell Damage\"> DMG to any Target within Range.</li></ul></li></ul><p>Cube Actions are the main abilities that Heroes use, and the effects of each Keyword can be found in the Summary. For this Tutorial, each Hero has the ones they use most explained on their Hero Boards.</p>"
        },
        {
          "title": "MAKING WEAPON ATTACKS",
          "bodyHTML": "<p>There is no basic action to Attack in CoD. Attacks are effects provided by Skills and Abilities that the Hero casts, just like any other effect.</p><p>Weapon Attack instructions follow the pattern “MAKE A <img src=\"/icons/2-melee-dmg.svg\" class=\"inline-icon\" alt=\"Melee Damage\"> OF +X TO HIT”, followed by any other Keywords that apply to that Attack.</p><ul><li class=\"custom-bullet filled\">The type (color) of the Cube used to trigger the Skill that includes the Attack determines its Range:<ul><li class=\"custom-bullet open\">Melee (yellow): The Attack can hit enemies adjacent to the Hero.</li><li class=\"custom-bullet open\">Ranged (red): The Attack can hit enemies that are in the same area (blue square) the Hero is in or the area adjacent to it. Heroes who are adjacent to enemies, however, cannot make Ranged (red) <img src=\"/icons/2-melee-dmg.svg\" class=\"inline-icon\" alt=\"Melee Damage\">. This is called “Combat Engagement”.</li></ul></li><li class=\"custom-bullet filled\">The player rolls the D20 and adds any TO HIT bonuses (+X TO HIT). If the Roll equals or exceeds their Weapon’s Accuracy value (in the blue diamond), the Attack hits and causes the damage indicated on that Weapon card, plus any damage bonuses the Attack has.</li><ul><li class=\"custom-bullet open\">If the Roll is a “natural” 20 (value rolled before any modifiers), the Attack is a Critical Hit—It deals double damage.</li><li class=\"custom-bullet open\">If the Roll is a “natural” 1, the Attack is a Critical Failure—They miss even if the To Hit bonus would be enough to hit.</li></ul><li class=\"custom-bullet filled\">Attacks made by a Hero who is on a board level above their Target gain a +2 TO HIT bonus, while those made from below the Target receive a -2 TO HIT penalty.</li></ul><p>Once these steps are completed, the Attack is complete.</p><div style=\"text-align: center; margin: 20px 0;\"><img src=\"https://druna-assets.s3.us-east-2.amazonaws.com/book/images/003-min.png\" alt=\"Vorn's weapon and Arcing Strike skill example\" style=\"width: 100%; height: auto; margin-bottom: 5px;\"><p style=\"font-style: italic; color: #555;\">Vorn is Attacking through his Arcing Strike Skill. Since Vorn’s Dwarven Warhammer has Accuracy 7 and his Skill provides a +3 TO HIT bonus, he must score at least a 4 on the D20 for the Attack to hit and deal damage.</p></div>"
        },
        {
          "title": "STARTGAME TRIGGER",
          "bodyHTML": "Now that you’ve completed the first Tutorial readings, place the Initiative Marker on Vorn’s (or the Hero who is playing the Defender role if it is not Vorn) Initiative card. That Hero can move to reach a Monster and make Attacks (²) against it. For purposes of this Tutorial, if the Vampire is killed, keep it on the board with 1 Health so as not to interfere with the following Tutorials. \nYou may begin to play the Adventure. Once the Defender’s turn ends (after taking their Move Action and Two Cube Actions), move the Initiative marker to the next card, the Vampire Monster, and read “The Monsters’ Turn” and “Reactions” in the Tutorial tab of your app.  "
        }
      ]
    },
    {
      "chapterTitle": "Game Rules 2",
      "tutorials": [
        {
          "title": "THE MONSTERS’ TURN",
          "bodyHTML": "<p>When the Initiative Marker reaches a Monster card, every Monster of that type takes its turn. ACTIVATING a Monster is done by following the four steps below. All the information you need for the behavior and abilities of that type of Monster is described on its card.</p>\n<ul>\n<li class=\"custom-bullet filled\">First, any Conditions that are affecting the Monster are triggered. This can lead to the death of that Monster if Persistent Damage (BLEED, BURN, or POISON) is among these Conditions.</li>\n<li class=\"custom-bullet filled\">Secondly, they “aim” at their Target for this ACTIVATION.</li>\n<ul>\n<li class=\"custom-bullet open\">Monsters can target different types of Heroes. In this tutorial, all Monsters have the “Strongest Hero” as their primary Target.</li>\n<li class=\"custom-bullet open\">Monsters prefer to target Heroes they can reach, given their movement ability. Therefore, they always target the “Strongest Hero they can reach.”</li>\n<li class=\"custom-bullet open\">The Strongest Hero is the one who currently has the most Health Points. In case of a tie, the Monster chooses the one who acts first on the Initiative Track among those tied for the most Health Points.</li>\n<li class=\"custom-bullet open\">If they cannot reach any Heroes, Monsters will use their movement to get as close to one as possible.</li>\n</ul>\n<li class=\"custom-bullet filled\">Third, they move towards their Target, if necessary.</li>\n</ul>\n<p>Monsters always follow the shortest path possible.</p>\n<ul>\n<li class=\"custom-bullet filled\">Finally, they attack, causing the damage indicated on their card. Monsters do not roll the D20; They always hit.</li>\n</ul>\n<p>Heroes may use Reactions (<img src=\"/icons/3-reaction.svg\" class=\"inline-icon\" alt=\"Reaction\">) to protect themselves. Any damage dealt that is not mitigated by PREVENT effects or SHIELD tokens reduces their Health Points.</p>\n<p>If there are two or more Monsters of the same type on the board, ACTIVATE the “fastest” one among them first, following the order on the Monster Status board: Monsters with a yellow base are the “fastest” while those with a brown base are the “slowest”.</p>\n<p>At this point in the tutorial, the first Monster to act may need to move to reach the Strongest Hero.</p>"
        },
        {
          "title": "REACTIONS",
          "bodyHTML": "<p>Reactions (<img src=\"/icons/3-reaction.svg\" class=\"inline-icon\" alt=\"Reaction\">) can be used whenever any Hero is Threatened—that is, when PREVENTABLE DAMAGE is about to be dealt to their Health Points.</p><ul><li class=\"custom-bullet filled\">Reactions can be used on both the Heroes’ and Monsters’ turns.</li><li class=\"custom-bullet filled\">To perform a Reaction, the Hero spends an Action Cube of the appropriate color, as they would when using a Skill as a Cube Action.</li><li class=\"custom-bullet filled\">Reactions, however, are not Cube Actions. Therefore, even if a Hero has not taken their turn yet or they have already taken both of their Cube Actions for this round, they can still use as many Reactions as they want.</li><li class=\"custom-bullet filled\">Each Hero can only use 1 Reaction per Threat.</li><li class=\"custom-bullet filled\">If any damage is dealt to Heroes who have SHIELD tokens, these tokens are discarded first. If they are enough to reduce the damage to 0, no Threat is generated.</li><li class=\"custom-bullet filled\">Heroes can React to Threats to other Heroes, but only if their Reaction can choose “ANY TARGET” as its Target. Reactions with “SELF” can only be used by Heroes to protect themselves.</li></ul><p>Once you have finished reading this topic, place the Recall Action Tutorial Trigger card at the bottom end of the Initiative Track, just above the End of the Round Game State Check-Up card.</p><div style=\"text-align: center; margin: 20px 0;\"><img src=\"https://druna-assets.s3.us-east-2.amazonaws.com/book/images/004-min.png\" alt=\"Recall Action card placement\" style=\"width: 100%; height: auto; margin-bottom: 5px;\"><p style=\"font-style: italic; color: #555;\">This is where the Recall Action Tutorial Trigger card goes on the Initiative Track.</p></div><p>You may proceed with the Adventure. The Vampires will now ACTIVATE, and at least one of them (if not more) will Attack a Hero with enough strength to cause a Threat.</p>"
        }
      ]
    },
    {
      "chapterTitle": "Game Rules 3",
      "tutorials": [
        {
          "title": "RECALL ACTION",
          "bodyHTML": "<p>By exchanging blows with Monsters, the Heroes’ Action Cube Pools will eventually run out. Whenever this is the case, the Heroes can take Recall Actions to replenish them.</p><p>Recall Actions can be Willing or Unwilling.</p><p>Willing Recall Actions can be taken by the Hero during their turn if they only have Action Cubes of two or fewer colors in their Pool. However, if a Hero chooses to take a Recall Action this way, their turn ends immediately.</p><p>Unwilling Recall Actions, on the other hand, are taken immediately whenever a Hero spends their last Action Cube and their Pool is empty. This, however, does not end their turn.</p><p>When taking a Recall Action, the Hero returns all their Action Cubes allocated to Skills or their Expended Action Cube box back to their Pool.</p><p>Recall actions are not free: Heroes receive a penalty whenever they take one, after collecting their Cubes. At the beginning of this Adventure, this penalty is 1 Curse Cube.</p><div style=\"text-align: center; margin: 20px 0;\"><img src=\"https://druna-assets.s3.us-east-2.amazonaws.com/book/images/005-min.png\" alt=\"Example of a recall action\" style=\"width: 100%; height: auto; margin-bottom: 5px;\"><p style=\"font-style: italic; color: #555;\">This is an example of a Recall Action, no matter what type.</p></div>"
        },
        {
          "title": "CURSE CUBES",
          "bodyHTML": "<ul><li class=\"custom-bullet filled\">Curse Cubes represent the physical, spiritual, and mental exhaustion that Heroes experience. They are usually acquired as a penalty for Recall Actions.</li><li class=\"custom-bullet filled\">Curse Cubes are the black cubes. The Hero must allocate them to their available Skills when they are received, blocking them from using those Skills.</li></ul><p>Curse Cubes remain on the Hero’s board until removed by CLEANSE effects.</p><div style=\"text-align: center; margin: 20px 0;\"><img src=\"https://druna-assets.s3.us-east-2.amazonaws.com/book/images/006-min.png\" alt=\"Curse cube blocking a skill\" style=\"width: 100%; height: auto; margin-bottom: 5px;\"><p style=\"font-style: italic; color: #555;\">Vorn has chosen to block Dwarven Breath with a Curse Cube he received after taking a Recall Action (this might not have happened yet within your tutorial).</p></div><ul><li class=\"custom-bullet filled\">If any Hero accumulates 6 Curse Cubes at the same time, they are corrupted and the Adventure ends immediately! This is another way for the Party to be defeated.</li></ul><p>Once you have finished reading these topics, place the Folding Doors Tutorial Trigger card at the end of the Initiative Track, just above the End of Round card. Proceed with the Adventure. The next turn on the Initiative Track is the End of the Round Game State Check-Up card. No Hero will be able to open a Door, so the Initiative marker just returns to the Defender’s card, starting a new round. This round will follow the same dynamic as the previous one, with the exception that, at the end of it, the Folding Doors Tutorial card will be read before the next round begins.</p>"
        }
      ]
    },
    {
      "chapterTitle": "Game Rules 4",
      "tutorials": [
        {
          "title": "FOLDING DOORS",
          "bodyHTML": "<p>Dungeon crawling in CoD involves opening Doors to reveal new places and challenges.</p><ul><li class=\"custom-bullet filled\">In Drunagor Nights, Doors can only be opened at the end of the round.</li><li class=\"custom-bullet filled\">To open a Door, a Hero must be adjacent to it and choose to do so after the Rune card (the last card on the track) is triggered.</li><li class=\"custom-bullet filled\">Doors cannot be opened as long as there is a Monster on the board.</li></ul><p>Once you have finished reading this topic, each Hero repositions their model in one of the squares on Map DNE2-F. At least one Hero must place their model in a square adjacent to the Door. Proceed with the Adventure, taking the End of Round card turn. A Hero must then open the Door.</p>"
        }
      ]
    },
    {
      "chapterTitle": "Game Rules 5",
      "tutorials": [
        {
          "title": "POPULATING A ROOM",
          "bodyHTML": "<p>Doors have instructions for the next Setup, indicating which Maps, Monsters, and other elements must be placed on the board. In Drunagor Nights, especially for players not yet familiar with CoD, it’s likely that the trays, Maps, and Doors will already be set up in advance. So, when opening a Door, the only task will be to populate the room.</p><p>These instructions were explained once during the First Setup, but you can review the process again here:</p><ul><li class=\"custom-bullet filled\">Place all the elements described in the Setup instructions until you reach the number of Heroes in the Party. If there are 3 Heroes, for example, place all elements listed for 2+ and 3+.</li><li class=\"custom-bullet filled\">Whenever a Monster is summoned, place its card on the Initiative Track, in the position indicated by the Rune and the arrow on that card.</li><li class=\"custom-bullet filled\">Place each Monster in the indicated positions, attaching a colored base to each. The bases match the colors on the Monster Status board. The order and colors of these bases do not matter.</li><li class=\"custom-bullet filled\">Mark the Health Points of each Monster on the Monster Status board. Their initial (and maximum) value is indicated on their cards.</li></ul><p><strong>NOTE:</strong> Drunagor Nights sessions are designed for a minimum and maximum of 2 to 4 Heroes, unlike the Core Box. CoD – Age of Darkness can be played from True Solo mode up to 5 players. The instructions there are presented starting from 1+, up to 5+.</p>"
        },
        {
          "title": "RANGED MONSTERS",
          "bodyHTML": "<p>Some Monsters can Attack from a distance. This does not change their overall behavior, but it does introduce some new things you must consider. They are subject to the same restrictions as a Hero when making a Ranged Attack:</p><ul><li class=\"custom-bullet filled\">Ranged Monsters can attack enemies up to 1 area (blue square) away, but are subject to Combat Engagement.</li><li class=\"custom-bullet filled\">A Ranged Monster will not Target a Hero if they would have to be in Combat Engagement in order to hit them. Instead, they will Target the next Hero in their order of priority.</li><li class=\"custom-bullet filled\">Ranged Monsters that are Engaged will move away from the Heroes who are obstructing their attack whenever necessary.</li></ul><p>Once you have finished reading these topics, place the Interaction Tutorial Trigger card at the bottom end of the Initiative Track, just above the End of Round card, then proceed with the Adventure.</p><p>The Rotten Monster introduced in this Setup has a Passive Skill: Attack Twice, meaning in short that it takes two Attack Actions when activated (but only a single Move Action).</p>"
        }
      ]
    },
    {
      "chapterTitle": "Game Rules 6",
      "tutorials": [
        {
          "title": "INTERACTIONS",
          "bodyHTML": "<p>CoD is not only about moving and fighting. The world is also full of scenes called Interactions: dilemmas where the players must decide how to act, which can affect the story in many ways, positive or negative.</p>\n<ul>\n<li class=\"custom-bullet filled\">The Hero responsible for the Interaction must choose one of the resolutions shown.</li>\n<li class=\"custom-bullet filled\">Each resolution of an Interaction can only be chosen once, even if a different Hero is able to interact with it later.</li>\n</ul>\n<p>Interactions can reward Heroes with Items or cause small changes to the Adventure narrative and gameplay.</p>"
        },
        {
          "title": "ITEMS I",
          "bodyHTML": "<p>This Interaction may reward the Heroes with some Items. Items are represented in the game by cards, and these cards come in two types: Equipment is gear that a Hero can wield in the matching Slot on the right side of their board; Consumable Items, on the other hand, are single-use treasures stored in their Bag.</p>\n<ul>\n<li class=\"custom-bullet filled\">Check your Hero’s proficiencies—They can only wield Equipment of those types.</li>\n<li class=\"custom-bullet filled\">If the Item is Equipment and the Hero is proficient, they can choose to wield it. Move any cards currently occupying the appropriate Slot to their Bag.</li>\n<li class=\"custom-bullet filled\">If the Item is Equipment and the Hero is not proficient, move that card straight to their Bag.</li>\n<li class=\"custom-bullet filled\">Each Hero’s Bag can carry up to two Items at a time. If a third Item is placed in it, the player must discard one of the three cards without applying its effects (if it is a Consumable Item).</li>\n<li class=\"custom-bullet filled\">When a Consumable Item is used, the player discards its card.</li>\n</ul>\n<p>Once you have finished reading these topics, each Hero and Pet repositions their model in a square of their choice on Map DNE4-F. At least one Hero must choose a square that is adjacent to the Door. Then, go to Interaction – “The Barricade”. A Hero who is adjacent to the Door is responsible for this Interaction: The decision is theirs, but you should discuss the options together.</p>"
        }
      ]
    },
    {
      "chapterTitle": "Game Rules 7",
      "tutorials": [
        {
          "title": "LEARNING NEW SKILLS",
          "bodyHTML": "<p>At the end of each CoD Adventure, the players will improve their Heroes to prepare them for new challenges. The first type of these progressions is Learning New Hero Skills.</p>\n<ul>\n<li class=\"custom-bullet filled\">Heroes can only learn Hero Skills on their own cards.</li>\n<li class=\"custom-bullet filled\">Each Hero Skill card has two sides—The front side corresponds to Level 1 of that Skill while the back corresponds to Level 2.</li>\n<li class=\"custom-bullet filled\">Whenever they learn a new Skill, a Hero will be able to learn Level 1 of a new Skill Tree or upgrade a Level 1 Skill they already have to Level 2.</li>\n<li class=\"custom-bullet filled\">Whenever a Hero learns or upgrades a Skill, they receive 1 Action Cube of the color associated with that Skill.</li>\n</ul>\n<p>At this point, each Hero gets to learn a new Level 1 Skill. Remember to collect the appropriate Action Cubes from the Reserve. Each Hero will now have a Pool of 6 Action Cubes.</p>"
        },
        {
          "title": "COMMANDERS",
          "bodyHTML": "<p>Some creatures develop magical mutations that make them much more dangerous. They are the Commanders of Darkness. They have special game mechanics, functioning as “Mini-Bosses” in an Adventure.</p><ul><li class=\"custom-bullet filled\">Commanders gain extra Actions each round. These are represented by Commander Attack cards that are ACTIVATED when the Initiative Marker reaches them. Commanders draw a number of Attack cards equal to the number of Heroes.</li><li class=\"custom-bullet filled\">Take the deck of Commander Attack cards (golden back), shuffle it, and draw one card for each Hero in the Adventure, placing them in the appropriate slots on the Track.</li><li class=\"custom-bullet filled\">Attack cards explain their own effects, like a Skill.<ul><li class=\"custom-bullet open\">The “X” value corresponds to the number of Runes of that color on the Initiative Track.</li><li class=\"custom-bullet open\">For this tutorial, however, the Commander requires a handicap to be balanced with the Heroes. Therefore, treat any value written as “X” as “Half of X (rounded down).”</li></ul></li><li class=\"custom-bullet filled\">Commander Monster cards, in turn, work like any other Monster card: When the Initiative Marker reaches it, the Commander ACTIVATES and takes its Move and Attack Actions.</li><li class=\"custom-bullet filled\">The Corrupted Gatekeeper will have 16, 32, 48, or 64 Health, depending on the number of Heroes. If you are interested, the equation that determines a Commander’s Health Points is described here:<ul><li class=\"custom-bullet open\">Commander Health = CP (described by the Setup with a number added or multiplied by the number of Heroes) times by R (Health Points on the Commander card).</li></ul></li></ul><p>In addition to being a Commander, the Corrupted Gatekeeper is also a Large Monster, and its size imposes some special rules.</p>"
        },
        {
          "title": "LARGE MONSTERS",
          "bodyHTML": "<p>Large Monsters are imposing enemies that occupy an entire area (blue square). In CoD, however, size matters, and this feature introduces some changes to the behavior of this type of Monster:</p>\n<ul>\n<li class=\"custom-bullet filled\">Large Monsters move from area to area. So, 2 movement points means they can cross 2 areas.</li>\n<li class=\"custom-bullet filled\">Large Monsters may move through or stop in areas occupied by smaller Monsters and/or Chests. Whenever they end their movement in an area occupied by these objects, reposition the smaller Monsters to adjacent squares around the Large Monster and remove the Chests from the board.</li>\n<li class=\"custom-bullet filled\">Large Monsters, however, cannot move through or stop in areas occupied by Heroes, NPC tokens, or Pets.</li>\n<li class=\"custom-bullet filled\">Large Monsters attack entire areas that are adjacent to their models. They hit every enemy in that area instead of just one Target.</li>\n<li class=\"custom-bullet filled\">Large Monsters prioritize hitting as many Heroes as they can over hitting the Strongest Hero.</li>\n<li class=\"custom-bullet filled\">If they manage to reach the same number of Heroes in different combinations, they prioritize the one with the Strongest Hero among them.</li>\n<li class=\"custom-bullet filled\">Pets do not count towards a Large Monster’s Target priority. However, they may be attacked “by association” if they are in an area that is hit by a Large Monster.</li>\n<li class=\"custom-bullet filled\">Large Monsters are Immune to KNOCK DOWN, PUSH, STUN, and TELEKINESIS. These Immunities are represented by the “LARGE” icon.</li>\n</ul>\n<p>Remember, the Special Rule – “Plot Armor” is still in effect. Once you have finished reading these topics, continue the Adventure on your own until you defeat the Commander and manage to open the next Door. This time, there is no Scene Trigger. The Heroes need to remember to open the Door.</p>"
        }
      ]
    },
    {
      "chapterTitle": "Game Rules 8",
      "tutorials": [
        {
          "title": "MINOR ACTIONS",
          "bodyHTML": "<p>Heroes may take a third type of Action in addition to Move Actions and Cube Actions: the Minor Action. Each Hero may take one of each of these actions during their turn to perform special tasks such as:</p>\n<ul>\n<li class=\"custom-bullet filled\">Loot a Chest.</li>\n<ul>\n<li class=\"custom-bullet open\">When they do so, the Heroes draw the top Chest card from the deck (the one with the image of a chest over the orange banner). Chests can contain traps in CoD, but don’t worry about that in this tutorial. These Chests are safe, and the Heroes can draw the cards without fear.</li>\n</ul>\n<li class=\"custom-bullet filled\">Give 1 Item from their Bag to another Hero.</li>\n<ul>\n<li class=\"custom-bullet open\">Bags are magical—There is no Range limit.</li>\n</ul>\n<li class=\"custom-bullet filled\">Equip, Unequip, or Exchange Equipment.</li>\n<ul>\n<li class=\"custom-bullet open\">Heroes do not need to have free space in their Bags to Exchange Equipment.</li>\n</ul>\n<li class=\"custom-bullet filled\">Interact with an Interaction token.</li>\n<li class=\"custom-bullet filled\">Any other effects described as a “Minor Action”.</li>\n<ul>\n<li class=\"custom-bullet open\">Some Dungeon Events or Class Abilities perform special effects at the cost of a Minor Action.</li>\n</ul>\n</ul>\n<p>Later on, Heroes will learn to use what are called “Focus Abilities.” Using one of these Abilities—if it’s not marked as a Reaction (<img src=\"/icons/3-reaction.svg\" class=\"inline-icon\" alt=\"Reaction\">)—also counts as a Minor Action.</p>"
        },
        {
          "title": "INTERACTION TOKENS",
          "bodyHTML": "<p>Interactions can be represented by tokens on the board. Whenever this is the case, that scene will not automatically be presented to the Heroes as it is when the scene is triggered by opening a Door. They need to Interact with the token if they want to encounter it.</p>\n<ul>\n<li class=\"custom-bullet filled\">Heroes must be adjacent to the token to do this.</li>\n<li class=\"custom-bullet filled\">As stated previously, this Interaction costs a Minor Action.</li>\n<li class=\"custom-bullet filled\">The same rules as for the scene apply, with two exceptions:</li>\n<ul>\n<li class=\"custom-bullet open\">The Hero who is Interacting is responsible for any decisions the scene requires.</li>\n<li class=\"custom-bullet open\">When the Interaction is complete, reduce the charges of that token by 1. If that was the last charge, remove the token from the board.</li>\n</ul>\n</ul>\n<p>Interaction tokens are Solid Objects, meaning that Characters cannot travel through a square containing one (unless they are JUMPING) or end their movement on them.</p>"
        },
        {
          "title": "DARKNESS NODES AND TIE BREAKERS",
          "bodyHTML": "<p>The influence of Darkness is so strong in this hall that every now and then it condenses into nodes of pure power. These nodes can strengthen the enemy, therefore destroying them is useful for the Heroes.</p>\n<ul>\n<li class=\"custom-bullet filled\">Piles of Runes represent Darkness Nodes. They are formed by taking 1 Rune of each color from the Initiative Track.</li>\n<ul>\n<li class=\"custom-bullet open\">Piles of Runes are Solid Objects, meaning Characters cannot travel through or stop in spaces occupied by them.</li>\n</ul>\n<li class=\"custom-bullet filled\">Heroes can take “Untie Node” actions as Cube Actions.</li>\n<ul>\n<li class=\"custom-bullet open\">To do this, they need to be adjacent to the Pile of Runes and Expend (move it to the Expended Cube box) 1 AC of their choice.</li>\n<li class=\"custom-bullet open\">When they do so, that Hero chooses a number of Runes equal to 6 minus the number of Heroes and returns them to the bag, regaining a few rounds before the Adventure ends.</li>\n<li class=\"custom-bullet open\">That Hero also receives either FOCUS 1 or CLEANSE 1. If you are playing the Tutorial Adventure and Focus Abilities have not yet been introduced, Heroes may choose to receive HEAL 3 instead.</li>\n</ul>\n</ul>\n<p>For now, Piles of Runes only slows the Adventure countdown tracker down, but there are other game mechanics that may interact with Piles of Runes in the future. So, assemble 1 Pile of Runes as shown below:</p><div style=\"text-align: center; margin: 20px 0;\"><img src=\"https://druna-assets.s3.us-east-2.amazonaws.com/book/images/007-min.png\" alt=\"Assembling a Pile of Runes\" style=\"width: 100%; height: auto; margin-bottom: 5px;\"><p style=\"font-style: italic; color: #555;\">Example of assembling a Pile of Runes.</p></div>"
        }
      ]
    },
    {
      "chapterTitle": "Game Rules 9",
      "tutorials": [
        {
          "title": "PASSIVE AND TRIGGERED BONUSES",
          "bodyHTML": "<p>Some Class Abilities and Skills can provide “passive” benefits. The most common types are Passive Bonuses and Triggered Effects. The terms and punctuation marks show how to manage these benefits, just like in Skills:</p>\n<ul>\n<li class=\"custom-bullet filled\">Dash (–): Separates the effect trigger from the Triggered Effect. The instruction written before the dash describes the trigger. The effect is written in the following sequence. “AT THE BEGINNING OF YOUR TURN – SELF: SHIELD 2” means that at the beginning of each of your turns, your Hero gains SHIELD 2.</li>\n<ul>\n<li class=\"custom-bullet open\">SURGE – This term means “Whenever you get a natural 16+ on a D20 roll during a <img src=\"/icons/2-melee-dmg.svg\" class=\"inline-icon\" alt=\"Melee Damage\">”.</li>\n</ul>\n<li class=\"custom-bullet filled\">Passive bonuses (usually “GAIN” or “INCREASES”) define benefits that automatically improve the Hero’s actions or attributes. The effect's description states whether it applies to actions you take or effects you receive:</li>\n<ul>\n<li class=\"custom-bullet open\">CAST – When a Hero (or their Equipment) is the source of an effect, we say that they “cast” that effect.</li>\n<li class=\"custom-bullet open\">RECEIVE – When a Hero is targeted by an effect, whether they cast that effect themselves or another Hero did, we say that they “receive” that effect.</li>\n<li class=\"custom-bullet open\">Consumable Item effects are also CAST and/or RECEIVED by each Hero, as appropriate.</li>\n</ul>\n</ul>\n<p>The vast majority of Passive Skills follow this description. There are exceptions, but the text usually explains itself in these cases, as in “YOUR MAXIMUM HEALTH INCREASES BY 4”.</p>"
        },
        {
          "title": "LEARNING CLASS ABILITIES",
          "bodyHTML": "<p>The second type of Progression that Heroes can receive during an Adventure is learning Class Abilities.</p>\n<ul>\n<li class=\"custom-bullet filled\">Heroes can only learn Class Abilities that belong to their Class.</li>\n<li class=\"custom-bullet filled\">Each Class Ability card corresponds to an ability tree. Heroes always start by learning a Level 1 Skill from a tree.</li>\n<li class=\"custom-bullet filled\">Whenever a Hero learns a Class Ability, mark it using 1 white cube.</li>\n<li class=\"custom-bullet filled\">Heroes do not need to commit to ability trees. They can start a new tree whenever they learn a new Class Ability.</li>\n<li class=\"custom-bullet filled\">Curse Cubes cannot be allocated to Class Abilities.</li>\n</ul>\n<p>At this time, each Hero must Learn 1 Level 1 Class Ability. Do not forget to allocate a white cube to indicate the chosen Ability.</p>"
        },
        {
          "title": "MULTI-TARGET MONSTERS",
          "bodyHTML": "<p>In addition to Large Monsters, some Monsters can hit more than one Hero with a single attack. This ability is indicated by the Keyword TWO TARGETS. Similar to Large Monsters, this feature introduces a small change to the Monster's behavior:</p>\n<ul>\n<li class=\"custom-bullet filled\">Multi-Target Monsters prioritize hitting as many Heroes as they can over hitting the Strongest Hero.</li>\n<li class=\"custom-bullet filled\">If they manage to reach the same number of Heroes in different combinations, they prioritize the one with the Strongest Hero among them.</li>\n</ul>\n<p>Once you have finished reading these topics, proceed with the Adventure. The next instructions will be explained when the next Scene Trigger activates.</p>"
        }
      ]
    },
    {
      "chapterTitle": "Game Rules 10",
      "tutorials": [
        {
          "title": "BOSS BATTLES",
          "bodyHTML": "<p>Boss battles are epic moments in CoD gameplay. In a way, the Setup and rules are the same as for Commanders, except that the Bosses are even more resistant and complex.</p>\n<ul>\n<li class=\"custom-bullet filled\">Each Boss Battle has a specific Setup (the players have already done this for the first Boss Battle).</li>\n<li class=\"custom-bullet filled\">Boss Attack cards determine their own effects. Just read them and apply the effects as you would with a Skill.</li>\n</ul>\n<p>The “X” value corresponds to the number of Runes of that color on the Initiative Track.</p>\n<ul>\n<li class=\"custom-bullet filled\">The Boss Monster card works the same way as other Monsters: When they ACTIVATE this card, they perform their Basic Attack.</li>\n<li class=\"custom-bullet filled\">Conditions afflicting the Boss take effect in the turn they ACTIVATE their Monster card.</li>\n</ul>\n<p>If there is any doubt when resolving an Attack card from the Undead King, refer to the clarification section for them in this tutorial.</p>"
        },
        {
          "title": "DARKNESS",
          "bodyHTML": "<p>Darkness is the main villain in CoD, and it is present in virtually every scenario of Age of Darkness. Two rules are associated with it: how it is placed on the board (Spawns), and the effects it applies to both Monsters and Heroes. Continue reading the Tutorial – “Spawning the Darkness.”</p>"
        },
        {
          "title": "SPAWNING THE DARKNESS",
          "bodyHTML": "<p>Each Adventure establishes rules for summoning the Darkness, but in AoD (Age of Darkness), they follow a pre-established pattern: In short, Darkness is summoned whenever a Rune is drawn due to the Darkness Hunting Rune card.</p>\n<ul>\n<li class=\"custom-bullet filled\">The card indicates the number of Runes that must be drawn. If 2 or more Runes are drawn for the same effect, draw 1 at a time.</li>\n<li class=\"custom-bullet filled\">The tile summoned onto the board is indicated by the sigil on the back of the Rune drawn. The color of the Rune doesn't matter at this point.</li>\n<li class=\"custom-bullet filled\">The tile must be summoned on a Darkness Spawning Point (underneath the Piles of Runes), or next to another Darkness tile that is already on the board. Darkness Maps count as Darkness tiles. At least one of the squares of the tile must be placed on the Darkness Spawning Point or touching a Darkness tile already on the board.</li>\n<li class=\"custom-bullet filled\">Players may position the summoned tile however they want, but it must follow the Darkness behavior: reach the Strongest Hero, or get as close to them as possible.</li>\n</ul>\n<p>Players may place the tile in such a way so that only the Strongest Hero is affected by it, if they can.</p>\n<ul>\n<li class=\"custom-bullet filled\">If the summoned tile does not fit on the board, or if it does fit but the fit is not in a position that is closest to the Strongest Hero, it is split into 3 Small Darkness tiles instead.</li>\n<li class=\"custom-bullet filled\">If the summoned tile needs to change board levels or hang off a tray to reach the Strongest Hero, it is split into 3 Small Darkness tiles instead.</li>\n<ul>\n<li class=\"custom-bullet open\">The 3 Small Darkness tiles are positioned in a way that reaches the Strongest Hero, if possible. If you succeed with the first or second tile placed, the remaining tiles are positioned to reach the next-Strongest Hero, and so on.</li>\n</ul>\n<li class=\"custom-bullet filled\">Darkness Tiles are not summoned if all Heroes are on Darkness tiles at the time a Rune is drawn.</li>\n</ul>\n<p>Details on summoning Darkness can be found in the Rulebook. The next topic explains the effects of Darkness.</p>"
        },
        {
          "title": "DARKNESS EFFECTS",
          "bodyHTML": "<p>Once on the board, Darkness becomes an obstacle for the Heroes and introduces small adaptations to the behavior of Monsters. The first effects described are for “contact”:</p>\n<ul>\n<li class=\"custom-bullet filled\">Whenever a Hero steps into a Darkness square, or ends their turn in one, they take 2 unpreventable damage.</li>\n<ul>\n<li class=\"custom-bullet open\">This damage is only applied once per turn.</li>\n<li class=\"custom-bullet open\">If a Hero steps into 2 or more squares in the same turn, they only take this damage once.</li>\n<li class=\"custom-bullet open\">If a Hero steps into a square, takes damage, and then ends the same turn in that square, they do not take the damage again.</li>\n<li class=\"custom-bullet open\">If a Hero steps into a square when it’s not their turn, they take the damage immediately; then, later in the round, if they end their own turn in that square, they take the damage again.</li>\n<li class=\"custom-bullet open\">SHIELD tokens can protect Heroes from this damage.</li>\n</ul>\n</ul>\n<p>The next effects are “passive”. These are bonuses and penalties that Darkness applies to Characters:</p>\n<ul>\n<li class=\"custom-bullet filled\">Heroes standing in Darkness suffer a -2 TO HIT penalty to Accuracy Tests.</li>\n<li class=\"custom-bullet filled\">Monsters standing in Darkness receive a +2 DMG bonus to their Basic Attack.</li>\n<ul>\n<li class=\"custom-bullet open\">Large Monsters only need to be in 1 square of Darkness to receive this bonus.</li>\n<li class=\"custom-bullet open\">This bonus only applies to Commander and Boss Monster Basic Attacks. Attack cards do not benefit from it.</li>\n</ul>\n<li class=\"custom-bullet filled\">Monsters seek the Darkness. Whenever they “aim” at a Target, if there is any Darkness square in which that Monster can end its movement without changing the Target, it will move to that square to benefit from this damage bonus.</li>\n</ul>\n<p>Once you have finished reading these topics, proceed with the Adventure. This is the final fight for this Tutorial.</p>"
        }
      ]
    },
    {
      "chapterTitle": "Game Rules 11",
      "tutorials": [
        {
          "title": "FOCUS ABILITIES",
          "bodyHTML": "<p>Heroes are also capable of casting special powers known as Focus Abilities. Flip each Hero board to its Advanced side—this version features new Skills and the Focus Abilities.</p>\n<ul>\n<li class=\"custom-bullet filled\">When casting a Focus Ability, the Hero must discard the appropriate number of FOCUS tokens. Casting a Focus Ability that is not a Reaction (<img src=\"/icons/3-reaction.svg\" class=\"inline-icon\" alt=\"Reaction\">) costs a Minor Action.</li>\n<li class=\"custom-bullet filled\">Focus Abilities that are Reactions may only be used as Reactions and do not cost a Minor Action.</li>\n<li class=\"custom-bullet filled\">The Range of <img src=\"/icons/2-melee-dmg.svg\" class=\"inline-icon\" alt=\"Melee Damage\"> performed when using Focus Abilities is determined by the category of the Weapon the Hero is wielding: Melee Weapons use Melee Range; Ranged Weapons have Range 1.</li>\n<li class=\"custom-bullet filled\">All other effects of Focus Abilities have Unlimited Range.</li>\n<li class=\"custom-bullet filled\">FOCUS tokens are Stackable Resources. Each Hero may have up to 4 of them at a time.</li>\n</ul>\n<p>Once you have finished reading these topics, continue the Adventure and begin the battle against the Undead King.</p>"
        }
      ]
    }
  ]
}