[
  {
    "id": "interaction-1.1",
    "type": "choice",
    "title": "1.1 – TAKE THE SHIELD",
    "body": [
      "Interestingly, this is not just any shield. You’ve heard of these, the Arcane Bulwarks of Valarai, used not only by Elven warriors but by wizards as well. This piece was made to block blows while also channeling arcane energy through it like a staff does. A treasure that will serve your cause very well…<br><br>",
      "Take the Arcane Bulwark Adventure Item card.<br>This is an Interaction with Charge tokens. Remove one of them now. If the current charge is the last one, remove the token from the board instead; The Heroes will no longer be able to interact with this scene."
    ],
    "actions": [
      { "text": "Return to Options", "type": "RETURN_TO_CHOICES" }
    ]
  },
  {
    "id": "interaction-1.2",
    "type": "choice",
    "title": "1.2 – TAKE THE HELMET",
    "body": [
      "The ferocity of the battles you have faced in Blackriver have taught you that danger lurks behind every attack, and a helmet as well-crafted as this one could mean the difference between life and death. Picking up the silver helm adorned with the plumes of a warlord, you hope it fits you…<br><br>",
      "Take the Silver Helmet Adventure Item card.<br>This is an Interaction with Charge tokens. Remove one of them now. If the current charge is the last one, remove the token from the board instead; The Heroes will no longer be able to interact with this scene."
    ],
    "actions": [
      { "text": "Return to Options", "type": "RETURN_TO_CHOICES" }
    ]
  },
  {
    "id": "interaction-1.3",
    "type": "choice",
    "title": "1.3 – TAKE THE SWORD",
    "body": [
      "It doesn’t take a great expert in sword forging to realize that this is no ordinary blade. The sinuous design and intricate runic carvings immediately reveal this as an elven masterpiece of the highest quality. A treasure worthy of an Earl, after all. Surely, this sword will serve you well…<br><br>",
      "Take the Elven Spellblade Adventure Item card.<br>This is an Interaction with Charge tokens. Remove one of them now. If the current charge is the last one, remove the token from the board instead; The Heroes will no longer be able to interact with this scene."
    ],
    "actions": [
      { "text": "Return to Options", "type": "RETURN_TO_CHOICES" }
    ]
  },
  {
    "id": "interaction-1.4",
    "type": "choice",
    "title": "1.4 – TAKE THE BREASTPLATE",
    "body": [
      "Every armorsmith knows that the breastplate is the most vital piece of armor. Not only for the protection it offers, but also for the grandeur it bestows upon its wearer. Many such craftsmen devote weeks of work striving for perfection, both in detail and functionality. Entranced, you run your hands over the plates, causing the blue runes to glow in anticipation…<br><br>",
      "If you have the “Suspended Protections” Status on the Party Campaign Log, proceed to resolution 1.8. Otherwise, continue reading below:<br>…a trap! You barely have time to regret your choices before energy begins to crackle around you, sending sparks flying through the air. The explosion hits you head on, inflicting terrible pain that you will always remember.<br><br>",
      "You take 6 damage (Heroes can use ³ normally).<br>This is an Interaction with Charge tokens, but this resolution does not spend any of them (though it still cannot be chosen again). Proceed with the Adventure."
    ],
    "actions": [
      { "text": "Take it (if you have 'Suspended Protections')", "type": "PROCEED", "target": "interaction-1.8" },
      { "text": "Take it (if you DO NOT have the status - TRAP)", "type": "RETURN_TO_CHOICES" }
    ]
  },
  {
    "id": "interaction-1.5",
    "type": "choice",
    "title": "1.5 – READ THE INSCRIPTIONS",
    "body": [
      "The adventurer’s life may be new to you, but getting your face blown up by a magical protection rune is not. Many treasures left unguarded by watchful eyes have one of these to protect them from impudent hands. You’d do well to examine those glowing symbols…<br><br>",
      "If you follow the Path of Mystics (check your Hero board), proceed to resolution 1.7. Otherwise, continue reading below:<br><br>",
      "…the problem is, to someone unversed in the arts of the Arcane, these scribbles are nothing more than meaningless drawings. A work of art that any child could create—if not for the latent energy pulsing from them. Is it really a good idea to touch this armor?<br><br>",
      "This is an Interaction with Charge tokens, but this resolution does not spend any of them (though it still cannot be chosen again). Proceed with the Adventure."
    ],
    "actions": [
      { "text": "Read (if you follow Path of Mystics)", "type": "PROCEED", "target": "interaction-1.7" },
      { "text": "Read (if you DO NOT follow the path)", "type": "RETURN_TO_CHOICES" }
    ]
  },
  {
    "id": "interaction-1.6",
    "type": "choice",
    "title": "1.6 – TAKE THE DAGGER",
    "body": [
      "A dagger is poetically lodged into the base of the armor stand, as if someone had driven it in with enough force to cause the cracks. Perhaps a subliminal message left to the Earl of Blackriver by a foe? Whatever the truth may be, this mystery will remain unsolved—because you pull out the piece. Your need far outweighs the rivalries of the dead…<br><br>",
      "Take the Ritual Dagger Adventure Item card.<br>This is an Interaction with Charge tokens. Remove one of them now. If the current charge is the last one, remove the token from the board instead; The Heroes will no longer be able to interact with this scene."
    ],
    "actions": [
      { "text": "Return to Options", "type": "RETURN_TO_CHOICES" }
    ]
  },
  {
    "id": "interaction-1.7",
    "type": "resolution",
    "title": "1.7 – YOU ARE VERSED IN THE ARCANE",
    "body": [
      "…to the eyes of a layman, they would be nothing more than a child’s scribbles—but not to you. You are versed in the arts of the Arcane, and your suspicion is confirmed: that is a Sigil of Guard, a rune that, if not for you, would protect the armor if someone tried to take the breastplate.<br><br>",
      "Write down the “Protection Undone” Status on the Party Campaign Log.<br>This is an Interaction with Charge tokens, but this resolution does not spend any of them (though it still cannot be chosen again)."
    ],
    "actions": [
      { "text": "Return to Options", "type": "RETURN_TO_CHOICES" }
    ]
  },
  {
    "id": "interaction-1.8",
    "type": "resolution",
    "title": "1.8 – YOU KNOW HOW TO UNDO THE PROTECTION",
    "body": [
      "However, since the inscriptions had already been deciphered, and all it takes is uttering the security word for the runes to settle once more. The blue glow fades, allowing you to retrieve the gleaming silver piece. Without doubt, the most beautiful armor you’ve ever seen. Would the Earl mind you taking it?<br><br>",
      "Take the Mirror Plate Adventure Item card.<br>This is an Interaction with Charge tokens. Remove one of them now. If the current charge is the last one, remove the token from the board instead; The Heroes will no longer be able to interact with this scene."
    ],
    "actions": [
      { "text": "Return to Options", "type": "RETURN_TO_CHOICES" }
    ]
  }
]