[
  {
    "id": "the-prisoner-intro",
    "type": "intro",
    "title": "THE PRISONER",
    "body": [
      "A man weakly struggles on a horizontal torture rack built to pull its victims apart. Strange spikes jut from his body, anchoring him to the machine as he claws toward them, wrists and ankles bound wide. When he notices your approach, he turns his head and cries, “Please! Help me! I have to get them out!”<br>A sickly green glow pulses from the two rigid spikes—Darkness piercing straight through his guts, buried deep into fragile flesh. They seem to be the true source of his agony. If freed too soon, he looks desperate enough to tear them out himself. You wonder how he’s even still alive…",
      "<br><br><b>RULE – MECHANISM INTERACTION</b><br>This Interaction does not use charges. Instead, unless a resolution specifies that the token is removed, it remains on the board. In addition, the options for this Interaction are not exclusive; they can be repeated, and the game state might lead to different outcomes."
    ]
  },
  {
    "id": "interaction-1.1",
    "type": "choice",
    "title": "1.1 – CUT THE BINDINGS ON HIS HANDS",
    "body": [
      "The way you found the man is horrific in every sense, both his mind and body being in a terrible state. You draw a knife and start cutting his bindings. The work has to start somewhere, and even if it doesn’t help, perhaps it might provide the man some small relief…<br><br>",
      "If the “<span style=\"color: #ff99ff;\">Pressure Relieved</span>” Status is noted on the Party’s Campaign Log, proceed to resolution 1.9. Otherwise, proceed to the resolution 1.5."
    ],
    "actions": [
      {
        "text": "If you have 'Pressure Relieved' status - (interaction 1.9)",
        "type": "PROCEED",
        "target": "interaction-1.9"
      },
      {
        "text": "Otherwise - (interaction 1.5)",
        "type": "PROCEED",
        "target": "interaction-1.5"
      }
    ]
  },
  {
    "id": "interaction-1.2",
    "type": "choice",
    "title": "1.2 – EXAMINE THE SPIKES OF DARKNESS",
    "body": [
      "Two spikes of Darkness pierce through the man from behind just below his ribs. The wounds appear to be agonizing, executed with the precision of a master torturer. You touch one spike and a scream of pain follows, accompanied by a thin stream of blood. These clearly are the reason why the man is so clearly out of his mind. Yet one thing is clear: you could remove them from behind him if you’re careful…<br><br>",
      "You face a dilemma: If you choose to carefully pull the spikes out from behind the man, proceed to resolution 1.6; Otherwise, continue reading below:<br><br>",
      "…Having wounded the prisoner unintentionally, you reconsider. He’s still surviving in this condition, even if the sight and ramblings are painful to witness. Sometimes acting too hastily only makes things worse, and you prefer to step back rather than bear the burden of worsening his plight by accident.",
      "<br><br>You may choose another option as part of the same Interaction or you may proceed with the Adventure."
    ],
    "actions": [
      {
        "text": "Pull the spikes out - (interaction 1.6)",
        "type": "PROCEED",
        "target": "interaction-1.6"
      },
      {
        "text": "Step back and reconsider",
        "type": "PROCEED",
        "target": "adventure-continue"
      }
    ]
  },
  {
    "id": "interaction-1.3",
    "type": "choice",
    "title": "1.3 – ATTEMPT TO HEAL HIS WOUNDS",
    "body": [
      "The Doctrine of the Church of the Setting Sun has guided the people of Daren for nearly a millennium, but beyond spiritual comfort it also teaches its several popular magics. One simple yet effective prayer restores wounds and soothes the heart, and you begin the ritual by reciting it…<br><br>",
      "If the “<span style=\"color: #ff99ff;\">Pressure Relieved</span>” Status is noted on the Party’s Campaign Log, proceed to resolution 1.7. Otherwise, continue reading below:<br><br>",
      "…A golden glow flows from your fingertips, touching the man’s body. He grits his teeth as if the healing magic itself is expelling the pain through his flesh, and the spikes begin to vibrate as if reacting to the spell. To your surprise, a thin stream of blood begins to trickle from his wounds, and you realize: the spikes are alive! They grow just enough to prevent the wound from closing by never allowing it to fully heal.",
      "<br><br>You may choose another option as part of the same Interaction."
    ],
    "actions": [
      {
        "text": "If you have 'Pressure Relieved' status - (interaction 1.7)",
        "type": "PROCEED",
        "target": "interaction-1.7"
      },
      {
        "text": "If you DON'T have 'Pressure Relieved' status",
        "type": "PROCEED",
        "target": "adventure-continue"
      }
    ]
  },
  {
    "id": "interaction-1.4",
    "type": "choice",
    "title": "1.4 – PUT HIM OUT OF HIS MISERY",
    "body": [
      "This is more than cruelty—crafting a person’s agony with such precision demands skill. The ropes, the spikes, the table’s position… Everything arranged to guarantee a slow, torturous death. You may not be able to undo the man’s torment, but at least you can bring it to an end mercifully. You draw a knife and deliver a quick stab below the prisoner’s rib.<br>But… his body has been far too corrupted. What follows is as painful to describe as it is to witness: the man twists in inhuman ways, his dead body now a twisted mass of flesh and Darkness, scattered around writhing like worms crawling toward each other, merging into a creature born from agony.",
      "<br><br>The Count transforms into a <span style=\"color: #3399ff;\">Commander of Darkness</span>. Replace this Interaction token with a <span style=\"color: #3399ff;\">Shadow Vampire</span> model to represent him.<br>Place the <span style=\"color: #3399ff;\">Commander Count</span> Monster card in the appropriate slot of the Initiative Track, then draw his Attack cards (1 for each Hero in the Party).<br>The <span style=\"color: #3399ff;\">Commander Count</span> has <span style=\"color: #ff99ff;\">15 HP per Hero in the Party</span>. Thus, he will have 15, 30, 45 or 60 Health Points, depending on the number of Heroes.<br>After defeating <span style=\"color: #3399ff;\">Commander Count</span>, take the <span style=\"color: #ff0000;\">Cormack House Crest</span> Adventure item and choose a player to keep it.<br>Proceed with the Adventure."
    ],
    "actions": [
      {
        "text": "Proceed with the Adventure",
        "type": "PROCEED",
        "target": "adventure-continue"
      }
    ]
  },
  {
    "id": "interaction-1.5",
    "type": "resolution",
    "title": "1.5 – THE PRISONER IS FREE",
    "body": [
      "…As the bindings come off, the prisoner's eyes widen. The man does what any living being might: acts hastily to ease his pain, but all he succeeds in doing is signing his own death warrant. Removing the spikes isn’t difficult, but in his hurry to remove the objects piercing his body the wounds in his belly tear open and a dark, thick blood pours forth as if reserved for this moment…<br><br>",
      "You face a dilemma: If you choose to try to reach for the prisoner, proceed to resolution 1.8; Otherwise, you may deliver a mercy blow and continue reading below:<br><br>",
      "…Mourning his misfortune, you act quickly, drawing your weapon and landing a fatal strike on the back of his neck. “I’m sorry…” The words choke in your throat as the man breathes his last, ending an agony that seemed eternal…",
      "<br><br>Remove this Interaction token from the board.<br>Proceed with the Adventure."
    ],
    "actions": [
      {
        "text": "Reach for the prisoner - (interaction 1.8)",
        "type": "PROCEED",
        "target": "interaction-1.8"
      },
      {
        "text": "Mercy blow",
        "type": "PROCEED",
        "target": "adventure-continue"
      }
    ]
  },
  {
    "id": "interaction-1.6",
    "type": "resolution",
    "title": "1.6 – YOU PULL OUT THE SPIKES",
    "body": [
      "…with some hesitation, you reach for the spikes from under the table and pull them out as carefully as possible. The prisoner screams in pain as the black spikes slide through his flesh and come out into your hands, malleable as if made of clay that hardens or softens at will. The man, however, lets out a gasp. His eyes suddenly became clearer as if a veil had been removed from his mind. The leftover wounds however remain untreated, and now the precious red liquid flows from two holes in his abdomen.",
      "<br><br>Write down the “<span style=\"color: #ff99ff;\">Pressure Relieved</span>” Status on the Party’s Campaign Log.<br>You may choose another option as part of the same Interaction or you may proceed with the Adventure."
    ],
    "actions": [
      {
        "text": "Proceed with the Adventure",
        "type": "PROCEED",
        "target": "adventure-continue"
      }
    ]
  },
  {
    "id": "interaction-1.7",
    "type": "resolution",
    "title": "1.7 – THE HEALING WORKS",
    "body": [
      "…a golden glow flows from your fingertips, touching the man and, little by little, the two horrific wounds close, bleeding for the last time. The prisoner grits his teeth at first, but soon an expression of relief follows, accompanied by a quiet “thank you.” His determination to live and fight returns, even if his body struggles to keep up with his spirit. You release the prisoner from his bindings, setting him free.",
      "<br><br>Remove this Interaction token from the board.<br>Read <span style=\"color: #ff0000;\">**“Scene – Flames of Vengeance”**</span>."
    ],
    "actions": [
      {
        "text": "Proceed to 'Scene - Flames of Vengeance'",
        "type": "PROCEED",
        "target": "scene-flames-of-vengeance"
      }
    ]
  },
  {
    "id": "interaction-1.8",
    "type": "resolution",
    "title": "1.8 – THE PRISONER IS ALREADY LOST",
    "body": [
      "…desperate, you reach for the prisoner and recite the first healing prayer that comes to mind. The golden glow that should bring relief, however, only makes things worse. His body has been corrupted. What follows is as painful to describe as it is to witness: the man twists in inhuman ways and his joints burst apart, flinging muscles, blood, and viscera everywhere. And that’s not all: the horrid mass of flesh and Darkness now scattered around you writhes like worms crawling toward each other, merging into a creature born from agony.",
      "<br><br>The Count transforms into a <span style=\"color: #3399ff;\">Commander of Darkness</span>. Replace this Interaction token with a <span style=\"color: #3399ff;\">Shadow Vampire</span> model to represent him.<br>Place the <span style=\"color: #3399ff;\">Commander Count</span> Monster card in the appropriate slot of the Initiative Track, then draw his Attack cards (1 for each Hero in the Party).<br>The <span style=\"color: #3399ff;\">Commander Count</span> has <span style=\"color: #ff99ff;\">15 HP per Hero in the Party</span>. Thus, he will have 15, 30, 45 or 60 Health Points, depending on the number of Heroes.<br>After defeating <span style=\"color: #3399ff;\">Commander Count</span>, take the <span style=\"color: #ff0000;\">Cormack House Crest</span> Adventure item and choose a player to keep it.<br>Proceed with the Adventure."
    ],
    "actions": [
      {
        "text": "Proceed with the Adventure",
        "type": "PROCEED",
        "target": "adventure-continue"
      }
    ]
  },
  {
    "id": "interaction-1.9",
    "type": "resolution",
    "title": "1.9 – FORTUNATELY, YOU HAVE ALREADY REMOVED THE SPIKES",
    "body": [
      "…a golden glow flows from your fingertips, touching the man and, little by little, the two horrific wounds close. The prisoner grits his teeth at first, but soon his face softens with relief, followed by a quiet “thank you.” His determination to live and fight returns, even if his body struggles to keep up with his spirit.",
      "<br><br>Remove this Interaction token from the board.<br>Read <span style=\"color: #ff0000;\">**“Scene – Flames of Vengeance”**</span>."
    ],
    "actions": [
      {
        "text": "Proceed to 'Scene - Flames of Vengeance'",
        "type": "PROCEED",
        "target": "scene-flames-of-vengeance"
      }
    ]
  }
]